src/cf/InformationRegisters/СформированныеСообщенияДляОтправкиМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СформированныеСообщенияДляОтправкиМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СформированныеСообщенияДляОтправкиМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьСообщение(НомерСообщенияОбмена, СообщениеОбмена, КодУзла, Версия) Экспорт
	
	НаборЗаписей = РегистрыСведений.СформированныеСообщенияДляОтправкиМП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НомерСообщения.Установить(НомерСообщенияОбмена);
	НаборЗаписей.Отбор.КодУзла.Установить(КодУзла);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.НомерСообщения = НомерСообщенияОбмена;
	НоваяЗапись.КодУзла = КодУзла;
	НоваяЗапись.СообщениеОбмена = СообщениеОбмена;
	НоваяЗапись.Версия = Версия;
	
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры 

Процедура УдалитьСообщение(Знач НомерСообщения, Знач КодКлиентскогоУзла) Экспорт
	
	НаборЗаписей = РегистрыСведений.СформированныеСообщенияДляОтправкиМП.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Отбор.НомерСообщения.Установить(НомерСообщения);
	НаборЗаписей.Отбор.КодУзла.Установить(КодКлиентскогоУзла);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьСообщение(КодУзла, Версия, СообщениеОбмена, НомерСообщения) Экспорт //Для серверного узла

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СформированныеСообщенияДляОтправкиМП.НомерСообщения КАК НомерСообщения,
		|	СформированныеСообщенияДляОтправкиМП.КодУзла КАК КодУзла,
		|	СформированныеСообщенияДляОтправкиМП.Версия КАК Версия,
		|	СформированныеСообщенияДляОтправкиМП.СообщениеОбмена КАК СообщениеОбмена
		|ИЗ
		|	РегистрСведений.СформированныеСообщенияДляОтправкиМП КАК СформированныеСообщенияДляОтправкиМП
		|ГДЕ
		|	СформированныеСообщенияДляОтправкиМП.КодУзла = &КодУзла
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСообщения";
	
	Запрос.УстановитьПараметр("КодУзла", КодУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Версия = ВыборкаДетальныеЗаписи.Версия;
		СообщениеОбмена = ВыборкаДетальныеЗаписи.СообщениеОбмена;
		НомерСообщения = ВыборкаДетальныеЗаписи.НомерСообщения;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСообщения() Экспорт //Для клиентского узла
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СформированныеСообщенияДляОтправкиМП.НомерСообщения КАК НомерСообщения,
		|	СформированныеСообщенияДляОтправкиМП.СообщениеОбмена КАК СообщениеОбмена,
		|	СформированныеСообщенияДляОтправкиМП.Версия КАК Версия		
		|ИЗ
		|	РегистрСведений.СформированныеСообщенияДляОтправкиМП КАК СформированныеСообщенияДляОтправкиМП
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСообщения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	

	Возврат ВыборкаДетальныеЗаписи;

КонецФункции 

#КонецОбласти

#КонецЕсли
